In [1]:
import numpy as np
import pandas as pd

In [35]:
shops_df = pd.read_csv("./datasets/shops.csv")
items_df = pd.read_csv("./datasets/items.csv")
item_categories_df = pd.read_csv("./datasets/item_categories.csv")
sale_train_df = pd.read_csv("./datasets/sales_train.csv")
test_df = pd.read_csv("./datasets/test.csv")
sample_submission = pd.read_csv("./datasets/sample_submission.csv")

In [36]:
shops_df.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [60]:
items_df.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [58]:
item_categories_df.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [39]:
sale_train_df.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [40]:
test_df.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [41]:
sample_submission.head()

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [78]:
# result = sale_train_df[[ 'date_block_num','shop_id','item_id','item_price','item_cnt_day']].groupby(['date_block_num', "shop_id", 'item_id', 'item_price',], 
#                                                                      as_index=False).count()
# result

In [145]:
price_df = sale_train_df[['date_block_num', "shop_id", "item_id",'item_price']].groupby(["date_block_num","shop_id", "item_id"], 
                                                                    as_index=False).mean()

In [146]:
item_cnt_day_df = sale_train_df[['date_block_num', "shop_id", "item_id",'item_cnt_day']].groupby(["date_block_num","shop_id", "item_id"], 
                                                                    as_index=False).sum()

In [158]:
price_df["item_cnt_day"] = item_cnt_day_df['item_cnt_day']
price_df.head()

   date_block_num  shop_id  item_id  item_price  item_cnt_day
0               0        0       32       221.0           6.0
1               0        0       33       347.0           3.0
2               0        0       35       247.0           1.0
3               0        0       43       221.0           1.0
4               0        0       51       128.5           2.0

In [164]:
sale_train_df.loc[(sale_train_df["shop_id"] == 5)
                 & (sale_train_df["item_id"] == 5232)]

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
2810654,28.08.2015,31,5,5232,599.0,1.0

NoneType